Revit 2027 API
ExternalService.ServiceId Property
 The Id of the service
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalServiceId ServiceId { get; }
Public ReadOnly Property ServiceId As ExternalServiceId
	Get
public:
property ExternalServiceId^ ServiceId {
	ExternalServiceId^ get ();
}
member ServiceId : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace